blog/2021/git-server-hook.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 20:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>云服务器配置 Git 仓库托管并使用 Git Hooks 自动执行脚本</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">云服务器配置 Git 仓库托管并使用 Git Hooks 自动执行脚本</h1>
</header><p>
上文见<a href="hugo-deploy-to-server.html">部署 Hugo 博客到 Ubuntu 服务器</a>。
</p>

<p>
之前的博客更新思路是，本地提交修改至 GitHub，再登陆云服务器，手动执行脚本，达到更新博客内容的目的。但是，从 GitHub 拉取代码较慢，于是想到可以把本地的更改同时推送到 GitHub 和云服务器。再通过 Git Hooks 自动执行「更新博客」的脚本，以此达到提升效率的目的。
</p>

<div id="outline-container-org1a403c0" class="outline-2">
<h2 id="org1a403c0">更新 Git 至最新版本</h2>
<div class="outline-text-2" id="text-org1a403c0">
<p>
云服务器的系统是 Ubuntu 20.04，所以可以通过以下命令安装 Git 的最新版本：
</p>

<div class="org-src-container">
<pre class="src src-sh">add-apt-repository ppa:git-core/ppa
apt update
apt install git
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b0e144" class="outline-2">
<h2 id="org5b0e144">创建 Git 用户</h2>
<div class="outline-text-2" id="text-org5b0e144">
<div class="org-src-container">
<pre class="src src-sh">adduser git <span style="color: #706565;"># </span><span style="color: #857575;">note difference with useradd</span>
passwd git <span style="color: #706565;"># </span><span style="color: #857575;">add password for git user</span>
sudo visudo
</pre>
</div>

<p>
修改 <code>/etc/sudoers</code> ：
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #aaca86;">root    ALL</span>=(ALL)       ALL
<span style="color: #aaca86;">ubuntu  ALL</span>=(ALL:ALL) NOPASSWD: ALL
<span style="color: #aaca86;">git  ALL</span>=(ALL:ALL) NOPASSWD: ALL <span style="color: #706565;"># </span><span style="color: #857575;">add</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ad1d69" class="outline-2">
<h2 id="org9ad1d69">配置 ssh 公匙</h2>
<div class="outline-text-2" id="text-org9ad1d69">
<p>
在本地主机执行以下命令：
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh-keygen -t ed25519 -C <span style="color: #ddbc91;">"email"</span>
</pre>
</div>

<p>
会生成两个文件：id_ed25519 和 id_ed25519.pub。将 id_ed25519.pub 文件里的内容复制到云服务器的 authorized_keys 文件中：
</p>

<div class="org-src-container">
<pre class="src src-sh">su git
mkdir ~/.ssh
vim ~/.ssh/authorized_keys
</pre>
</div>

<p>
然后在本地添加私匙：
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh-add ~/.ssh/ssh_rsa
</pre>
</div>

<p>
如果不添加私匙，还是提示输入密码。
</p>

<p>
注意： <code>~</code> 代表 <code>/home/git</code> 。只有 git 用户才能使用这个公匙。
</p>

<p>
修改权限：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9fbfdf;">cd</span> ~
chmod 600 .ssh/authorized_keys
chmod 700 .ssh
</pre>
</div>

<p>
本地测试 git 服务：
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -v git@server-ip <span style="color: #706565;"># </span><span style="color: #857575;">Server public network IP</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org937b028" class="outline-2">
<h2 id="org937b028">创建博客文件夹</h2>
<div class="outline-text-2" id="text-org937b028">
<div class="org-src-container">
<pre class="src src-sh">su root <span style="color: #706565;"># </span><span style="color: #857575;">switch to root user</span>
mkdir /home/hugo
chown git:git -R /home/hugo
</pre>
</div>
</div>
</div>

<div id="outline-container-org2adb933" class="outline-2">
<h2 id="org2adb933">更改站点目录权限</h2>
<div class="outline-text-2" id="text-org2adb933">
<div class="org-src-container">
<pre class="src src-sh">sudo chown git:git -R /var/www/hugo <span style="color: #706565;"># </span><span style="color: #857575;">for git hook</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd82716" class="outline-2">
<h2 id="orgcd82716">创建 bare 仓库并配置 Git Hook</h2>
<div class="outline-text-2" id="text-orgcd82716">
<div class="org-src-container">
<pre class="src src-sh">su root
<span style="color: #9fbfdf;">cd</span> /home/git
git init --bare blog.git
chown git:git -R blog.git
vim blog.git/hooks/post-receive
chmod +x blog.git/hooks/post-receive
</pre>
</div>

<p>
新建文件 <code>blog.git/hooks/post-receive</code> ：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #706565;">#</span><span style="color: #857575;">!/bin/</span><span style="color: #91a0b3;">sh</span>
git --work-tree=/home/hugo --git-dir=/home/git/blog.git checkout -f
<span style="color: #9fbfdf;">cd</span> /var/www/hugo
rm -rf * <span style="color: #706565;"># </span><span style="color: #857575;">&#21024;&#38500;&#25991;&#20214;&#22841;&#19979;&#30340;&#25152;&#26377;&#25991;&#20214;&#20197;&#20445;&#25345;&#26368;&#26032;</span>
<span style="color: #9fbfdf;">cd</span> /home/hugo
hugo --minify -d /var/www/hugo
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc97bf71" class="outline-2">
<h2 id="orgc97bf71">本地配置云服务器仓库</h2>
<div class="outline-text-2" id="text-orgc97bf71">
<div class="org-src-container">
<pre class="src src-sh">git remote add origin git@server-ip:/home/git/blog.git
git push -u origin main <span style="color: #706565;"># </span><span style="color: #857575;">first push</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7418618" class="outline-2">
<h2 id="org7418618">参考</h2>
<div class="outline-text-2" id="text-org7418618">
<ol class="org-ol">
<li><a href="https://segmentfault.com/a/1190000039676421">https://segmentfault.com/a/1190000039676421</a></li>
<li><a href="https://www.saintsjd.com/2011/01/what-is-a-bare-git-repository/">https://www.saintsjd.com/2011/01/what-is-a-bare-git-repository/</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>